---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltGripLengthIncrease
source: html/937d87c6-6b02-6065-cfcb-7c77dab34276.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltGripLengthIncrease Property

"Grip Length Increase"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemBoltGripLengthIncrease { get; }
```